[
    {
        "reviewId": "gp:AOqpTOEUUUxHPC6TX6-8ehASI-a8hzZRhFc84Z-ENrqPkfD624I_JsvoLx3S6fj5qRjTA7GiHt5h2k4NqMXh77E",
        "userName": "West Hubbard",
        "content": "I was admittedly terrified downloading this app given the other reviews, but everything worked shockingly perfectly. Took about 10 minutes to get all three fans/lights connected, and then into Google Home. Maybe I just got three perfect units, but it was super easy, and I couldn't be happier. I have only two negative comments on these fans as a whole: 1. The wiring instructions for installing these fans into a box controlled by two switches 2. Google home can't control fan speed Otherwise A+",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOG1KMxPKja6oGtAedAg-oK73Vdst6CkvVcPWg3Wa1o8klPU1jFebCMU0yCcjqWAuMiHF7B0a9C2V_3zfaM",
        "userName": "scguy p7758",
        "content": "Doesn't work well with my Samsung S10. It takes 10 minutes to turn the fan on or off using this app.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHHxqnDXbikCt8timFJRnJxNyIXb6FSWsSZf-YJyKH3VzgIHetPjDxHpZ9UF0HV5YMsf1OYOG7XIeeQ9HA",
        "userName": "Daniel McAloon",
        "content": "It never worked, and customer service stopped replying to me after i confirmed that i had done everything correctly. I had to do a chargeback on the $200 fan",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFZ1Fvo6p1POKZlnqBXoBuTPONnN1ZmUsIMqgasOyzeOCEP9Z8iL1A_mYEPm1R442n0idQs9VBrr05dqaU",
        "userName": "Un Griffo",
        "content": "Can't connect two weeks...",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOGIcb1L2zt-bWCOJQzb9SpjyaGXROR816ZDm3m8IabwT3ijhSi_4dDfHCZjLeDpFeSAVN2tHeIeMFcD_DA",
        "userName": "Molly S",
        "content": "Disconnects from fans so I cant control them with my phone",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHjvxUJceoMPk2qOhbZsdtW0Z3QYepUc-3nRc2pmZaIy7ZN35Oo7AHftJ9pWw3gRmV6lXWMMrdiQBsmOos",
        "userName": "D Kirk",
        "content": "More Chinese JUNK, Hunter fans have tiny motors encased in big empty housings! the simple connect app is total trash, I bought three fans, the app keeps disconnecting from one fan, about half the time the other fans don't respond or it takes 20-30 seconds for it to react. Hunter sold out, and is selling garbage with garbage apps, your new Hunter 400.00 fan has a 25.00 walmart motor in it from China, and an app designed by a high school dropout.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEf0K3Iux6_CRu4igCIPScu5y69TuWpeksOOfEf0zhbyC8M_S0qT7h0DtJiMztqBUaeBDBZaCc1mor27XE",
        "userName": "Puneet Jain",
        "content": "This is a solid negative one star app. I spent 6 hours to pair new hunter cavera II with this app. I read extensively about it and I still couldnt get it done. First, it requires 2.4Ghz wifi. But what they dont mention that they require ancient version of 2.4Ghz and not the current. You need to find a phone which released in 2012 or earlier and then make a hotspot out of it. Then their Android app still wont work. Find an iPhone to connect to that ancient hotspot and pair it.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOFcUJzcq2EJ6E1X6jrVYA71H15J6uF9UTHKRkNsy55mR_plFgvNtSxCLz85KH2a5-GBLMgZnlo0DuBNX8w",
        "userName": "Note 8",
        "content": "UPDATE - MALWARE, BEWARE After trying the link on several systems and browsers I found it is not failing, it is being blocked as a known redirect containing malware. Hopefully a fix soon. Now an expensive paperweight with no access. If you still have a working old version I'd keep it and sit this out for a bit. The new one seems to re-verify credentials then send a link to confirm on a dysfunctional server. And voila! You are orphaned with no access and no path to recovery.",
        "score": 3,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOGQmkgB4bXBrhtoN-62mi7_sAFMlzFrDbSvi_5JpjpmIRwiD8TRtw97164ITF7UmMzGOuJnm4g2IO544dg",
        "userName": "john philipsyhyy",
        "content": "Will not send back login to my email. Hunter said I need android 10. Alexa doesn't even need android 10.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOGQkjQh4YPtU2rMi7eMyL1mBFx735rlVVPvwxm7arLP5gUQChyPI_MPdLJ3Amb3TueE9l9yvA9XsP4aFvY",
        "userName": "Victoria Merida",
        "content": "Without fail I always have to open and close and open again the app in order for my fan to appear.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFRX03vjk-prNuynp-z_RUq3ZmDWzsLDI2eJ0w2o8mutZ327asm5Na2s4V_RGypc-74vMMVBOAzwsFx23k",
        "userName": "Lowell Ball",
        "content": "This is a horrible app. I've tried for an hour to log in. Same thing every time. Says log in info not found. Try to reset over and over. Nothing except the same. I wish I had read all the reviews, that most everyone has had the same experience. All my other home automation apps work easily. I will be taking my fans back to home depot. Unbelievable!",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOF_HXBP_TKD0pBfQVyc2jLynlc1e5D-kPu4mI5Mn-9yw9LKIpGdTWoDf2DCrpvR9kkBuIwB5YXlALk1jW0",
        "userName": "Paul Russell",
        "content": "App sucks can't get an acount set up never received an email so can't get logged into app to even set up to work with phone net alone alexa",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFF25LD1R3o3ckA95NL-RCMANQm5F3vKyvsT6zCRLNVYDLq66GTXUaKel4S8BV3HoQ2VVZxSy32FMmpBtY",
        "userName": "Paul Schiele",
        "content": "If I would have known how horrible this app was I never would have purchased these fans. There are bad apps and there are awful apps. This falls into the awful, avoid at all cost apps. The fans never stay connected to a smart device and some have never connected. Even after connecting them, at least 60-70% of the time they will not respond to the smart device. I've never had this issue with any other devices connected.",
        "score": 1,
        "thumbsUpCount": 6,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEzGB7ZBcPRz1DdKYjLSrIBv1KYp4iQHVh_a-_MjMTeWlffwhThQMw_dI7U3CYOceCjHxzbJKY7F7sF1Wk",
        "userName": "Nick Crouch",
        "content": "Much improved from previous but still has problems.. fans in different rooms can't be named differently and app crashes when trying to edit 3rd fan info..",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFi1I_fcnHjQNMkTWoqJP3tmNmYvAqR8yZzUJY5Z0kOYtGbxKyayqQvMLGP5R9z9fpxPiEiyvP674Knr18",
        "userName": "Bernard lansiquot",
        "content": "Rename to Difficult Connect. Cannot connect for the life of me. Second hunter fan and I'm very disappointed. Bought this fan for the wifi capabilities that do not work. My network is solid, this app is weak.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOH4E_e-PxMlUEwYJZx0telFElj2Q-sKIrLTQgbrJqc3fsNQp4J9K7aPDFZvfw_tBemo2i2_jh5o9QSzC1Y",
        "userName": "Chris Kozlovsky",
        "content": "Having trouble working with Google home doesn't turn it on or off",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHx9l5wxbkZEQQ2sNg9PVSxPtPKRNQaeQ86WY2l2F8eTFqpkHmxesvGCn9mE_GS-o7MxVzz5h5nXTzSdWg",
        "userName": "Mark Van Beez",
        "content": "Horrible. Does not work. The company knows the app doesnt work and they still market it on the box. Shameful.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEHTEfqi7NP70IabAHmtJMKhoEkEPRIwjJYCoypCcPMZBItDqxsBKsAzTMdJmgB85dAnSiZsVhiQk7fYGo",
        "userName": "micah miringoff",
        "content": "Worked great but its no longer working with Google home for some reason. No idea how to fix it ive trouble shot everything.",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFG7x94ojk7XQio76zJuhnXRkkja3rOSfOz7viWRKRm_S0_GigdTQ9CJnyjwYIhAE9ezIrdFfaXW40SA90",
        "userName": "Gary Sorensen",
        "content": "Update: 9/21Two Weeks now! Still no attempt to solve by \"support\". No reply, NONE since I sent in my QR code as requested. Don't blame COVID for terrible support! This is HUNTER! Even small businesses can and DO still support their PAYING customers because they actually VALUE them. Update: Don't expect ANY support at all. Been waiting weeks after submitting a ticket. They play delay games...waiting a week then asking for details they already had in the ticket. Then another long delay. Then asked for a pic of my QR code. And back to no reply. What will their next delay tactic be? Maybe they will ask how to spell my first name. Their \"support\" is even worse than their app and their fan...and their BS is showing. RUN THE OTHER WAY!",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOF21HR_fFAkVVLHKIbU6l141E0h5I7IZkFw_ZSco8vF9Un6KDFb7QwCZKvZ3mI46pltGCuefRx--aUwN0w",
        "userName": "Charles Marine",
        "content": "Actually works now",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEIQjf9PBDI5IBDV3jKjkTopp2SUtjoFwhqPP2V1ApD-OzVZVOJBthEx9N1VXodH9_X1JfLhNQmLj409WE",
        "userName": "Michael Pollack",
        "content": "Useless. Always get \"provision_failure\" errors.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEjtsBeE9xThvbm6Kjmw9bZAgky10Ps0eZ5cicbgv6DjQ_JrpKURBHuwLxMyWzvj36KbERLcy_O-ebUch4",
        "userName": "Kirkland Yuknis",
        "content": "Is the best on the market, but still has much to be desired. The amount of time between requesting a function on either the remote or the app and the fan responding is absurd. The ceiling fan seems high quality and the installation was well thought out, however even after balancing it there is a very slight metal brushing metal sound, in addition to a mild high pitched electrical whine. Ultimately I recommend it if you want a smart fan, but there are a few annoying bits. I WANT AN API!!!",
        "score": 3,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHD5b5h36jqCsSpJqnHvhonY7PnY9Qx0zJpxPvFL8UioWyLpdqAqLoYblSnCiv30TWqvY6KoRCXwE8D2ts",
        "userName": "Medio Monti",
        "content": "Worked flawlessly with no fuss. Easily connected with Alexa too.",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEkbiAwwF0rfNoUKtepj5ZpK_1OUI03xKCeARs7TzLz4wlJ9DcNYzR6d6p11_WQYEbguoq9F1kYB7aE4YM",
        "userName": "Rob Z",
        "content": "Well, I was connected to the fan/light - and Google was working just fine. Out of nowhere (not during any app update), I can no longer connect to the fan to WiFi and therefore the app/Google no longer work. Help please?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHMRQmUGnajZF9qOg0kq7Hf1_HiEYsRFDR9AVpR3nHepxAwq3CT43gM9cW7REkD_KnAm19ZlGYNjnfSy_M",
        "userName": "Drummer's Key",
        "content": "Rarely do I write a review but this app is pretty useless. Although what I read about this app (assuming 1.0), this did actually connect to my Android device. My largest complaint for the app is that there is no widgets available. The app does 2 main functions, operates the fan and operates the light so having a widget, versus going into the app and then the item you want to control is annoying. Maybe this is the fan (which I have complaints about too), turning the light to off in the app either doesn't work at all or takes forever to actually work. Oddly, I turned off the annoying beep and it gave me more issues. When it's on, it works better. Last, a schedule feature seems like an easy and obvious improvement.",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEL0VEIif9bRIF2m7qZKRXj9cOxUm3mPDA3xOVQtSzUNyhEbl4DgkB51_KVJSBlikjJNVeJGma_cvbeHAs",
        "userName": "john t",
        "content": "Terrible time to connect like everyone else. After an hour of doing it over and over it finally worked. But now the next day it just says offline and doesn't work. Cycling power on the fan doesn't work either and now i can't add it again.. I want my money back for this fan. What a scam :( wish like hell I'd read the reviews before buying this.",
        "score": 1,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFQeg2nQNrpDhQLU8X6tUv90Dmm_ZiDnE7E42iq0AHhgaX36qozppB9rhiirePHa0gYC_eTtdtmJrt9YbI",
        "userName": "Mark McMillin",
        "content": "Absolute trash tier app. Had to use two different emails to register because the first one would never send the confirmation email and checked the junk folder. I followed the app instructions and got the provisioning error like everyone else complaining. The app continually kicks back to try and connect to the fan which says its successful and simultaneously having a token problem with our wifi connection. Tried several different ways to connect and change settings but no luck. Terrible app.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHKJaINFENuyx7sH39wUKRR9W5sWs7DU6qX8C3RpQ02H9ITXkO4HmidKK24v52g--9xOmmUQziJdRPRoGU",
        "userName": "Madhavi Latha",
        "content": "Sucks ... not working at all",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEFMOu7WSUzHe9Qs65qVMvZx2fWaX7Om9lcvURKeKUXORiB8x8OVxgy5txRnzHJwBdgu3suJo00v4abtbM",
        "userName": "James K",
        "content": "Doesn't work half the time",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFvivvCyJukcLZg007b-wbD9Z09wtQQYkUO-TW6Eu1ID2GYS9LeGdoiLmvYhjx6P5opsSXDr38YN1GAd4Q",
        "userName": "Vanyel Smith",
        "content": "Registration experience is still a pain. The app recently stopped working and I had to reconnect it to my fan which took multiple tries. This new version has removed the ability to control the fan speed with Google Assistant. I used to be able to change the speed from low to medium to high and back again as long as the fan was on first. That option no longer exists either by voice or inside the app.",
        "score": 3,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOF5BlNTTrMq-cuFY_MirgYJKHL_HV1J7bf3reg-YqzDwxEt3c-mU2PxHZ6vIx3EidxRFSbHgWRivvvoFiY",
        "userName": "Jeremy Kronenberger",
        "content": "Like everybody else on the planet, it just doesn't work for me. Background in tech and IT, and this app and it's programming are laughably awful.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEjVR5y4E784UqjL08jmyqLE8LXc8KFg35QBH_3e5uQAQadSr4H8FcwbiubytJze-TxkLJ1q_KQpKts9is",
        "userName": "Nicholas Dininno",
        "content": "Can't link up with my fan. I have 2g wireless at home so there's no reason this shouldn't work. I've tried different devices, iphones etc but nothing works. This app and the support associated is garbage. I'll never buy a simple connect enabled fan again in my life.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOGaSZnsmWZfjlFVtnE19bagwniBYYpk6QglJ9sA7zvrSCael0ON0RENSfr-JDTsEUeSPaF0hQ3Lv80Yu2Q",
        "userName": "emil scrivanich",
        "content": "I would give it no stars can't get it to work on my phone and call hunter they give the same story it has been escalated to tech people but I never hear back from them.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHJztOZ094SA3MRBJfN8IlPjETSOl-Mc4gSdH_bOkuskTWwegs9nnViFxfs4Ai05LaFyl0URawfTUqGR3U",
        "userName": "Jon Rowe",
        "content": "Pairing function does not work. \"Provision Failure\"",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHkexfK4qxxWMWG0XO-648HeVeH-pvtiUKtC_aB55br8aKdA_juJl3pNBsw75mwkVxE4eG7Hl4HrxketHs",
        "userName": "Shane Degen",
        "content": "Fan purchased in 2017 is obsolete. Hunter wants me to buy a new fan so it can work with their app. Sorry, 30% off isn't enough to make be replace a fan every few years. I'll go with a company that actually supports their products next time.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOGVb7QtrtQ1c0cNRQAXgPJKs6807Wq3KnyHToXBYJdPyCftNYya5LHzfQNU9wIyuFy61_uUTaSMKtGh1BE",
        "userName": "Dee Love",
        "content": "Well, let's start at the beginning.. I wanted to install two wifi fans in my home, but I had to buy 4 fans and keep returning the defective fans just to find two that would actually connect to the app.. The app is really buggy, I now have two simi working fans connected to it and on any given day one fan or the other will not operate via the app or google home. On more than one occasion I've had to unlink the fan and link it again to get it to work.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFTv57Q0daRNeUP1-6j9LTQdT3h510OOtgv1eGQ4kDWShq6cB0a28ufi3UWxUn79Jj816jVt-52WFFxy_w",
        "userName": "Shawn Parker",
        "content": "Please fix this app now and make better.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHqMdt_giZpJdpwIRO7JQwP683Hulkw7SIkfIF0V7hn-XVqThtQmp0MsmbF1XdpZJrzeTIlCVCQGQZwr7I",
        "userName": "Joshua Sorenson",
        "content": "This app exists purely because the Hunter fans include an obnoxious audible beep by default. It offers nothing that isn't already available with the included remote and requires wifi to set up. As an app experience, it is actively user hostile. This is all in stark contrast to how thoughtful the fan packaging and installation instructions are. I removed this app immediately after disabling the beep.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOFl3jWSw2H8Mpjf8nvfiEsIc-Z6sD7waZU-Uend-qRFE2m6TW-VWZNiZA6kSSPfd-wVqgRxYMXjp698BYI",
        "userName": "Laura Leukaufe",
        "content": "I had an account a few years ago and now l can't log in. Back then, it worked but it took too many clicks to open and it only worked on one phone at a time.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOF5ylcKsQz-MWzi9RFx9BspmagUr1PwCGgmpW3i-D4Ek0OAbS5HmNK13sK3z1ZgMOb-1TgvYeW8TMG7mhk",
        "userName": "Geir Hundal",
        "content": "This is, by far, the worst smart home app I have ever used. Problem areas: 1) The app completely fails to register my fan. I have a background in IT and have followed the limited troubleshooting information on the website. 2) Customer support has not answered my two email inquiries. 3) The wifi capability is marketed heavily , drawing in potential customers, but then is virtually impossible to use. Hunter, please hire multiple additional team members to quickly resolve this.",
        "score": 1,
        "thumbsUpCount": 5,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOHEbdEoW4DH05luNzxqqVl8Rc5C5Q9PkfK9nbZ7wv0q0csgvh8ojpxbbbj1BnggfiSAUXACOSxUFvPpY2M",
        "userName": "Tom Brink",
        "content": "After a couple of hours and a couple of different devices, I finally got my Hunter fan on my network. Initially I tried my OnePlus 6, which is over 2 years old, and had zero luck getting the fan on the network. The app found the fan and I successfully entered all of the required information, but I continually received Provision Failures with code: fetch_token_failure_q. I dug out an old Nexus 7 (2nd gen), which is almost 8 years old, and finally got the fan on the network on about the fourth attempt. The fan is decent. The app is mediocre. The pairing process is horrid. All of this, just to turn off the annoying beeping sounds when ever I touch a button on the included remote. (Hunter, I don't need a beep to know I turned the light on/off.) If you want to join the smart home market, try some hue or nest devices and take some pointers from their, often times, smooth pairing process.",
        "score": 2,
        "thumbsUpCount": 7,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEQ1P_6LzmZW19Vzxlf25s5Xu4wk8PLmK5MJvsVd936WDXh7DudxWEfgwwHnUI7AgQu4yOCrYqgQjpYMQE",
        "userName": "Brian Mcerlean",
        "content": "My fans are offline now i can not reconnect them with my wifi. What a waste. This app sucks",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOFxj-RBiRwgz3AY6Ht5u_wobJdIpbQqb7fAeCapPUKW_6rXvqybl8w5o4UjyGvhb9TEPvS0DqPoo6RgMgI",
        "userName": "Adrian Schwartzmann",
        "content": "Took hours to get working. Needed a 6 year old phone because anything newer didn't work. The only functionality it exposes to Google home is light on/off, dimming and just fan on and off. If it supported zwave I would be buying 4 more. As it is i'm afraid the next time I change router or wifi password I won't be able to get it to work again. If it supported zwave or ZigBee then it wouldn't break when hunter shutsdown the service and app. Would return it if I could. It was a bad impulse buy.",
        "score": 1,
        "thumbsUpCount": 5,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOGvHZcYB64i70gp5FumzwEBYYlhSr1vOYVdFKas9zskoa7XDGGpu6c5wNmeEwFb2pubagFHKBJE_pVpNhw",
        "userName": "Mathew Farber",
        "content": "It when but the experience is very buggy. Works with Google Assistant but only the fan portion. Light says inactive but I can control via the app. Please fix.",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOFCebl8f69pZeGWpeAw8rbfZUSY0xmoasq6f4E6KkieZQl8dWD0VlGDCfcDR2JdG_JprRNyCkJwul4JjeM",
        "userName": "Brandon Brennan",
        "content": "Fan installation was quick and easy only took 30 mins to hook up, however the app is bad so far hope they come up with a fix as of rtight now i cant use it at all",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOFtkIUpErQrahEB0O6vYvkl0dN44zKhCKoeQeb6vAYLKaTMW2cg1YiCHEqUFjbZDW7Es7JdO9BwgkElETI",
        "userName": "Stephanie Dodson",
        "content": "Doesn't work sometime",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEEmoDYV6bwfgjlMgMRbGfNUt_qSOa0DQzoGqPjZ6DQ8xP7ZOh5G3tS5B_qa18I_GD3B2_vnCXOCtATsXU",
        "userName": "Kimie Kano",
        "content": "Love that i can lay in bed and turn off my light. When i was on vacation i was able to turn off and on my lights. When i came home from my vacation ib was able to turn on my fan an hour before getting there.",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOEfNzFm5WMFlf3mimMQgkqaAPhODaQPfiEa0AgbksE5OyQ5R1Xj8sLBUmiqriX-BoMlAC0Uz5EmSr3qSxI",
        "userName": "Mike Hild",
        "content": "Will not connect fan to wifi. Finds fan but unable to \"register\". App says wifi authentication error. I know password is correct, so what wifi is it trying to use? There are several around my house that show on my phone. Why not allow user to select, or enter wifi ssid, like the roost app does?",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.1.33"
    },
    {
        "reviewId": "gp:AOqpTOG3cjR7lu3LPmLp1kDsqGAkBVemylh92OTqd5MmpBchdMckfdvjZpFhMJch3jUr6FQkxm17tjkWJi1QPzA",
        "userName": "Joshua Donovan",
        "content": "Very disappointing plus a waste of money and effort. I couldn't even get an account opened because it won't be verify my Gmail account. New name: NOTSIMPLEconnect 2.0",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOH0SoE6hWNr6KtW8grWBoYd1Rkm6awq_v6QMkKL7EaSATBI5VKOXXYGGldIaC7YseLHspL2nt6Sw1CJo2Q",
        "userName": "Franz Bruyere",
        "content": "We had purchased a Hunter ceiling fan that says on the box: \"Want more control? Don't forget to add our SimpleConnect programmable control!\" Nowhere in the instructions does it specify anything for this. We also purchased the Hunter \"Universal Ceiling Fan Wall Control\" wall switch (Model 99375) so that we could control the fan & light from the wall easier. Unfortunately, we were not aware that the wall switches are not the SimpleConnect system, you seem to have to purchase a hand-help remote. Other than that, we don't have an issue, but would rather be able to use the App (it doesn't pick up our system) and I'm sure the app would do fine. Until such time as we get the hand-held remote, we'll do with the wall control, and I've uninstalled the app.",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOFtHaRjFtR2syZ69r47lcMk_zCgYd2dRam20QUbzUm09jSpcM4ZD62suzFvbqzR0C-eMRAhIaRqmRikTH4",
        "userName": "PolArt",
        "content": "It doesnt work, something is wrong with the (wifi) connection ...so is not a simpleconnect Im so upset",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.1.30"
    },
    {
        "reviewId": "gp:AOqpTOG6VlIHbadATlZCU7VclmQE4Cvq6qNH2F9gh_R0h1jDQycPxr3JcRtPsId3yYaT8DpsYPhA_pfVRSx2E8I",
        "userName": "Mark Monroe",
        "content": "Horrible to set up. Keeps asking to verify email. Not user friendly. Looks like others here have same issue. Need to fix this issue",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.30"
    },
    {
        "reviewId": "gp:AOqpTOGbuE4ec0m1xwJ9Hgm8Gp_y0OdLVyNuh5wA--DeXo4dpldsTmnHkpPVHK4sEdKK9jUHkH-HclY4M51jI64",
        "userName": "Justin Ryan",
        "content": "Ridiculous! The account verification email to set up my new account didn't work, so I tried again. That one didn't work. It couldn't recognize my email/password. So then I tried to change the password, and now my account is LOCKED! I couldn't even try the app. How much security do you we really need for a ceiling fan app?? Good grief!",
        "score": 1,
        "thumbsUpCount": 5,
        "reviewCreatedVersion": "v1.1.30"
    },
    {
        "reviewId": "gp:AOqpTOH6TbQCfJIBbfT05sACytlL7XdWjCdlnrBo0Me4qX8AwpoY0vq3wx8sjaixMeJVxdWCbbTh4I5GK3LW60A",
        "userName": "Craig McCoy",
        "content": "I can't get it to work .",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.30"
    },
    {
        "reviewId": "gp:AOqpTOF5EIqqZNo-wt1h5lF-yLHqIo2Xh_eE72fVoHXhQ0klQXNy95huy68JIr_-82R5wHlLkqxKqHz6xAskWjA",
        "userName": "Alan Farwell",
        "content": "DOESN'T WORK. CAN'T GET PAST THE SET UP. SERIOUS ISSUE WITH PROGRAM. I.T. will not communicate by phone. Only by email, and they are redundant information over and over. Quick to sell the product, but NO SUPPORT. I've made over a dozen calls. Talked to 7 base level representatives. All giving the same directions. All said it would be need to be referred to I.T. Finally got an email yesterday. Got two responses with no resolve and they fell off the map. No follow up. No concern.",
        "score": 1,
        "thumbsUpCount": 4,
        "reviewCreatedVersion": "v1.1.30"
    },
    {
        "reviewId": "gp:AOqpTOEYd30byaI8BWJz33kIp-cxqWIQOnk0u1Mrdxu4dW3IQ0XcBcRwY64HqF8OVqnOIghZ8O9WuOKdI9iokQU",
        "userName": "Jose A. Montalvo",
        "content": "It works great! Hooked up in a second once proper setup procedure was observed. Works great with Alexa. Update: gave it 5 stars and the original problem was not with the appliance, it was the Internet Providers fault for failing to provide correct wifi password",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.30"
    },
    {
        "reviewId": "gp:AOqpTOEzVs2BOTbbKPamhTlxt1l63XpuETQ-16mHIdO_FokDUxiNPB8HBGvdKuTReWuRkWPZZ-zKWqnSsNi4QUQ",
        "userName": "Joe Black",
        "content": "The developer finally updated the app that wasn't working at all. Now all my fans with lights can be controlled by my phone and more importantly, Alexa! One took several tries, but at the end they work now! The app itself is a little clunky, but still good. Oh, and now I am able to disable the sound when you use them. Thanks!!!",
        "score": 5,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.1.30"
    },
    {
        "reviewId": "gp:AOqpTOHXbwDORf2a5pxG7eoxQwoLqxnNrf_Wb52J_avQ4rVyeh6HugLWkfai-xK0fmNBhtGF9VcsYxQr9_RcrNg",
        "userName": "Diego Sandoval Miami Fl",
        "content": "it does not connect to wifi 2.4 it says registering but stays there forever",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOF4cLkEpPIplL9fCWnB6GtER-f-gkYWtRwVSXnl4gSyGlzcm956ZpM5MX4NRZDqPaWmyarRJvJzHaJtuGs",
        "userName": "John Murphy",
        "content": "CELLINGFAN",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOHf-Z1WGxE3M_zi3MqCd7eQvEmgxsT3DBy-aff3UrEp8gYtY7CG-6rmJm6eQn9rR6GPD5fh2KZdq0xaIUI",
        "userName": "Karen Voiss",
        "content": "I am unable to connect this app. I have been trying for a week. This is ridi. I called and waited on the phone for over an hour and finally hung up. Had I known this was such a nightmare to set up I would have purchased the same look for $100.00 less. I emailed customer support, hopefully someone can figure it out. So ridiculous!!!",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOFiakdMyjxKJ5oiMlRVrdT5g_IONlNdBRBS29wq5_BfxpYGeYz8jzvdSYVfA0pnMGNE761jgBKbMIciUR0",
        "userName": "jeff gebert",
        "content": "Easy WiFi connection it was simple and fairly quick. Problem: I have four fans and I can't figure out how to name them so that I know which one is which.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOFUKMveDQ_ovzv0RzkYcINFi31cPJMPKWx7bhqcdxIZ6X2RaQv6NUTKh4YOEb70h-MAbJopyncPi5Jfy6g",
        "userName": "John H",
        "content": "Can't log in and app are terrible!",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOFN_lkT04_H9FYqLy0e6VfE9gqBtWV3mjrO9O4UBiJUCJheXtxRe5zNL0D1cpETpgfJO-l7AQSeFgv8n6Q",
        "userName": "Garrick Johnson",
        "content": "Getting better, but still needs work.",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOG8uhGpEGmDLVnv8pw9uAEyTL96AsMGi1q_-6AwrNr5V2HUDeflADX0Jrr1AbcEP5477GzU_YZI0zkwbMs",
        "userName": "Firefly K",
        "content": "Cannot connect. Tried multiple times with multiple people of different ages. No luck. Disappointed would be the work I would use for this app. Fan is good, but could have saved the money and bought the one with out the wifi connection. I did send a message to you. Did not get a response.",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOGPpS8DpfC72yR590vcPF7esA-m46F0dAjRUN1anzYN8HJDQ8NF07eJwaaDGkwckEeUfN-YA04mkpwmTJA",
        "userName": "Roger Henderson",
        "content": "The app and fan are both trash worked great for an hour now app and remote will not pair with fan",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOF0GySOOxZhkV4jtHMLLSxT37e6nTWea3NM-cWDMBJ4ZqY8ZBzoPRV2voNYguyrWnmPWKa_7rzDLY2D_o0",
        "userName": "Barry Ong",
        "content": "wifi won't connect when with 2.4 ghz. not smart at all",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOE1ki2hm7jKMCVo2jYNrfaK6rQsKFUO3Q83ePcd_xBdLBmwNyP9_R0DPUj2KLB6VSo6OSDpHQTxmaW2B8M",
        "userName": "Kevin Frye",
        "content": "Update 06/10/2020: Went from a 3-star to a 5-star. Now with Google Home compatibility enabled, I am very happy with both the fan and the app! Hunter Cavera was easy to install, the app setup right away, Alexa works really good, and so does Google Home! Feedback: I've noticed the lights turn off after a few days. I'm not sure if someone in my house is saying a command to Google, which does that, or if there's an auto-timer. I have Hue smart lights in it. More Google Home commands would be cool.",
        "score": 5,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOFRh8CjJvreQeS9iB1pDovXZ-h2fvPGP9Xo3f8eTGxnlnUvnJGZjXd6SrfbEm3rckR7x9b4FVE75s5IlG8",
        "userName": "Mark Mecord",
        "content": "Difficult install, doesn't control speed, and requires camera permission. Tried it out, the remote works better. De-installed this version, may try again with a newer one when it is released.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOHj5KVV7GL_PJga2KVuS-mbewnIsaBp55612Pz2gSzmJe5fzmgLXa8BeaG6_1Z-cqkE4aqk5fq7thU7o1o",
        "userName": "Noel Ong",
        "content": "This App is not very clear, how do you change the Wifi Network of Hunter Symphony Fan?",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOHRPFsu7FDwM_7KwcxYwENNKer8iNX6xe4p7wU9PV_MTAs62FGKjg7R5tvLt6J0QSXeMeU37efA13L1frw",
        "userName": "Rob Pleiman",
        "content": "I have had a lot of issues with connecting 2 fans to my network. I finally got them working but after a power outage, neither one came back online and I have not been able to add them back. Continue to get errors every time I attempt.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOFf0SSQbxu93lk1kTJMr8MhNmTywjU7UDkRqhUNdiMSW_NtNAgHrcEOq_5J8ezO5X3pmtyX64DYd0yHcNk",
        "userName": "Thomas Johnson",
        "content": "Why in the hell does this app need to know my location and requires me to let it record video and take photos before I can use it?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOGc6x3rjBsbKKRm3aqcpV74Dx3w_Ir_tGf2hFGJhvSZQQ0bWXaQd10O6yluCgXBCC93-x_6Vx5LMD_lwoQ",
        "userName": "Candy Crooks",
        "content": "Horrible service. Hunter doesn't even respond. My fan is bluetooth and the ap no longer works. Their solution is to just ignore it",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOFcEtJueRUean3QKxAgsRW5Hrtq7E9qH9mG3a95vyHsWSOPi3mlaKQboImH6aoSJrhm4fZmRqTXRfNjkeQ",
        "userName": "Mike Mayo",
        "content": "Updated 6-1 Works great now. worked perfectly initially. Now it can take a minute before Alexa says ok and the light or fan turns on or off. Not sure if that's what other people have for issues. I love Hunter fans. They are so easy to install. Setting up the app you must be on 2.4ghz band. Wait until everything is setup in the app and working before you try anything with Alexa. Open Alexa and enable the skill. You'll have to link the account so know the password you setup for simpleconnect app.",
        "score": 5,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.1.28"
    },
    {
        "reviewId": "gp:AOqpTOF7ne8PTjAmqGuBPSxQXYf2-D9c84Kw3cYaVNolUuHHv12j83-dYMpnNbnMhQLlnc1FhGY17QORtSpSn1I",
        "userName": "Donovon Clayton",
        "content": "It's does not work with google assistance like it claim it does.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOHKMXRY7lUhkfHD81ygb5gcX_3f3lvR7wnNteJVCxSaICMYtLvO9Hnu4ycRM9z4E2x-YjfCDJ6jV7bQfvk",
        "userName": "Steve Johnson",
        "content": "The app keeps recognizing the fan as the Wi-Fi connection. Home Wi-Fi is disconnected when this happens.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOESFe1oDMxIf1I62FrJLVbNaehtJNcKIdxVluS9y4giw5gJKtZEU-foKPg4nRXxCNeM2BY0Mkb47Vo_hQ4",
        "userName": "Mark Poole",
        "content": "Works good. A little difficult to set up . Instructions are vague and sometimes there's a delay when you click on a command.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOGF88An39BTJlVJE8EjZdW8lifjH-dUyOowV5qSLPuflbrrycSN3iJGufZIbEs70rmWgtMo3JFrpbw4Tg4",
        "userName": "Im Just Ruthie",
        "content": "Doesn't work with Google Assistant. Bought one of their fans because it was advertised all over the online listing it would work with google assistant, amazon alexa, and apple homekit. Not only does it not work with google assistant, (says feature coming soon), apple homekit isn't even listed in the app settings. Can say the app works. But a key feature that's a selling point doesnt even work. Edit: Thanks for the reply but your app still doesn't work with google home. My Simple Connect Account will not link to google home and it's not google home's fault. Everything else in the Google Home app works fine. I would wake away the 1 star if I could because you all still don't have it working right after years of having this implementation.",
        "score": 1,
        "thumbsUpCount": 4,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOG5AOxq4CUJ39Is0svw0aKgafFb2mYDvFurB6so7H_ShaXH_N8KxkOeKTYl3xK_QHxQCZGqd0DS0XU7s3M",
        "userName": "Chris Rumbaugh",
        "content": "False Advertising Does not work with Google Assistant Update***** They respond to my review like I didn't know how to add a service to Google. I did that process and Simple Connect wasn't on the list idk a hundred times. They add it today and act like it's been there the whole time. Also there are bugs. It won't connect to the account. Yes I am using the correct sign in credentials.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOECaviuivXIyuYRE7BqNCt4_Z41Fr-nYDDZsJA37kiTwe7GYcAMoh5SlweDzvrbRe3m91Ixe4JEYFtJBMw",
        "userName": "Derek DeVries",
        "content": "The new account creation process is broken; despite entering an email address and a password that met all of the specifications, I was unable to advance to the next screen to verify my email address. Also, the account creation process has a bad UI; it's not immediately clear that one needs to swipe left to get to the next page.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOHe0yF-fZ9cgxThhQy6qxrK-ZGfpoiU914vxGzCCNfmmo8DtRn-3R033z0hZ8cPP6kNsB5fce8ja6fv3bI",
        "userName": "John Gorton",
        "content": "So far I can't get the app to find the fan after being on hold for a 1/2 hour they said they would have someone who knows how the app works call back. Still haven't heard back",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOE-WL4mrv0JrUlmqih5dJkhXEdkbdUeqHL2fY48pBjZaiwT7BxBYfs4F2bXWsEfZtBt6954KdZaLypNQiQ",
        "userName": "Sean Hennessey",
        "content": "The Cavera was an awesome and amazing purchase!, but the app is ass! I know it could be a lot better then this",
        "score": 1,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOE-xFiAS_roPk8cp0jgzNfvqyVUOstCyNUjrNUUnK_tP6zjxYrClprkK3gd6dMxpd3ufg2W3m9VNQRe3QM",
        "userName": "Gio Sorchini",
        "content": "Does not let me create an account",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOENSDs-zscNiPNH5hMqI4_CT4PzgLAr_p5UTaZIuYihYbx3yknuK8shBVPrFuvBY8F3KTCRubcDD-3l6Fo",
        "userName": "Luis Benitez",
        "content": "It was easy to install but the issue is connecting with Google assistant. The instructions say hey Google connect to simple connect but nothing happens. Then you go to the app and it says coming soon. When will it work with Google assistant?",
        "score": 3,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOG6FaI5FOBu6vIrSyZ7A82Vrl4pM4LYHXnHpzUvr4sMXUEDgsj17pSaLuyy4rDtH4NXnIOseubROz-cuXs",
        "userName": "Rolf B",
        "content": "Won't let me past the second sign up screen.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOGLQMJ_zbKccegbmPuS6u0E1yBkk3AUm0lVaWIxHF2cRnAgOJRXytLIrOAB05GZbfGhLUitdPVmLrZfyLo",
        "userName": "Jonathan Jenkins",
        "content": "I've had this fan for a year-and-a-half with no issues. The recent update to the application posed to be a problem when trying to reconnect the fan. I contacted support via email. The problem was within my router settings and the way they found out was the technician ordered the same router that I had to find out the problem. I know there are some bugs in the new application but the technician gave superb customer service and went above and beyond to get me back online.",
        "score": 4,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOHxEto0Au52jSWNpJHIdA1O4y74V3cedHJHPrW1PH6yzcSxQnfjlDh5nEzWksdzZKG6TcQOdCfEurJLDWc",
        "userName": "Julio Maldonado",
        "content": "I bought the fan for Google assistant....I've tried 3 different phones including iOS and it said feature coming soon when you click assistant ...isn't that false advertising",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.1.24"
    },
    {
        "reviewId": "gp:AOqpTOGA4cd2sf7hHUA7Hblu5WFFU6fwPtvyCp-UDTY_SAnurySig7pQtH9LKdMTfGqcTMz72cbtxqV8MWH1YHY",
        "userName": "Simon Kaulius",
        "content": "Works great. I bought my fan today (5/5/20). I see other reviews on here complaining about compatibility with old fans. After I installed the fan on my ceiling, I verified that the physical remote was working fine with it. Note you must do a one time activation of the light dimming feature... just simultaneously hold the up/down arrows on the remote for a few seconds. You should now be able to dim the fan light with the remote. This must be in place in order for the app or Alexa to be able to dim the light as well. I installed this app on my Android Samsung Galaxy Note 10, and then scanned the QR code that came with my fan. It registered fine and the app started working fine. On my Alexa app I downloaded the skill for Hunter SimpleConnect. I then entered my login info into that app which matched my login info I established in this app. I then had Alexa discover new devices and it easily found the fan and the fan light as separate devices. Note that for some reason Alexa discovered the light twice, so I had to delete one of the instances of the fan light from the devices screen of the Alexa app. I'm able to successfully tell Alexa things like \"Set Simon's Fan to 50%\", or \"Set Simon's Light to 10%\", as well as tell Alexa to turn on/off the fan or the light separately. I love it.",
        "score": 5,
        "thumbsUpCount": 5,
        "reviewCreatedVersion": "v1.1.2"
    },
    {
        "reviewId": "gp:AOqpTOFIf7CdBd5KClyi33inYBq1Zpj1bR_ty2ow_ri0cUyrPp9zxexXBoUA8i7Bo4eXLVb4ZAkVzvUCE7a3uoA",
        "userName": "Tim Pierce",
        "content": "This app, unlike the previous version, actually works. You will need the 8 digit code from inside the remote cover or the manual to connect. Simple, but it actually works finally almost a year later. Was that so hard?",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.2"
    },
    {
        "reviewId": "gp:AOqpTOHpaLxWxXnNirSguFlnBv-Q3mUrgbSAB-UnXcqq-EKgU9i67wYzAkpImLioj0z6qZQuiTnetEhAXhzi_IQ",
        "userName": "C G",
        "content": "In reference to the 1.0 app: \"Class action lawsuit? Who's with me!? Dropped support for current models (read: older models still being sold) leaving some folks with \"stuck\" setting, etc ...\"",
        "score": 1,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.1.2"
    },
    {
        "reviewId": "gp:AOqpTOEj82hkJix2O1hZX_eoeHToZe_TdOGgvQhsf4YcfTeCDvawKNfuCwa55C9OpI-oTOdpFSALudWba9NGb2c",
        "userName": "Christina S.",
        "content": "(To Hunter fan company no they said they where Obsolete.) If you buy the older model fan's with just Bluetooth don't even try to download this app because we called customer service they no longer support old models because they are no longer are supported by technical service. Our fans are only a year old if that.",
        "score": 1,
        "thumbsUpCount": 4,
        "reviewCreatedVersion": "v1.1.0"
    },
    {
        "reviewId": "gp:AOqpTOF-9Q27_AhtSdXfsquAIaRG7qpUU184GYtir5VDZHZlNSgGeta0vbEdJ68UBZB0myXsZte-vKFr8MNtgYY",
        "userName": "David Webber",
        "content": "The app would not install on my s10. My kids so worked great. Now controlled with Alexa.",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.0"
    },
    {
        "reviewId": "gp:AOqpTOHrKKpLzSnY3XOlOKJCTk1TcrB8bB-ydWli9caAcM9geA1IlL6dhhFRHzfC_Ezx61jWRmGBTvH4B8-9Okw",
        "userName": "Jeff Zacuto",
        "content": "This \"upgrade\" is a total dumpster fire too. What a total waste of $300 for this fan. Do NOT buy Hunter Douglas fans - you'll regret it.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.1.0"
    },
    {
        "reviewId": "gp:AOqpTOGZ1TBfD-qcU8Iy8lzLT7Hz6_JxbZOsE3chAUZiyPOr1moJf4J36kZnc5Wl5UEYFwINAqc-A48GRbVc1mI",
        "userName": "Bradley",
        "content": "I voice privacy concerns and concerns over app permissions and you guys go and promote Alexa and Google Assistant. Makes you guys look pretty stupid. I have never used those spyware services and never will. I deducted another star. I wanted to give feed back in hopes your app would improve so we could update our house. Companies make smart hub independent options. I was hoping maybe in a year you guys would get a clue, but some companies dspite good programmers lack good design. Ill buy elsewhr",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOHiX5Em_uEPH-HnFuPlkd4bN5hm2L3WC4G3HiUBn0E6-rSQWqtA3WgB3EwVLZoyNDKiNpkfZ4AoMaCLc54",
        "userName": "Kelli Waibel",
        "content": "Very easy to use",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.0"
    },
    {
        "reviewId": "gp:AOqpTOH_G3U9yVYMtIho9sQHMkWOcG1WuNp_E7cjjdR0xhAoMvhcUwo1ABRg0jcGuKC1X872SxfDte3dsrjF4_Y",
        "userName": "Patrick",
        "content": "Trash. Will not connect to wifi ROMULUS model.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.1.0"
    },
    {
        "reviewId": "gp:AOqpTOEtpUSEUz6Uy-65E4AAC8V9sai0tRl1wxz_NC47Bx-O8CW5Oz40-OOU4y9rXKDHGMv513Nkt_8pX7hemeo",
        "userName": "Kurt Gooden",
        "content": "Bought fan that advertised Google Assistant and Alexa support. In app it says \"coming soon\" when I click on that feature. Shameful.",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.1.0"
    },
    {
        "reviewId": "gp:AOqpTOHFyjSjiQNvebGKUpmf4YrnX9U9v2vVnvChSVjQ37xbGbiJy13M-rTiWy1SujqAgrrdmN_qAiNFgrtY2Mg",
        "userName": "Raymond Trinh",
        "content": "Hunter Signal fan. Paired with fan with no issues. No issues to control the fan on/off, the rotation summer/winter direction and fan speed. Issue with controlling LED is the dinning does not work. LED will either be on/off.",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.0.29"
    },
    {
        "reviewId": "gp:AOqpTOHoepen4lkly0ouJGN6sNf13UkNIVWzeV9ELC_ilQR6_IO8aVhb9DpcETbKXB7uEXrJXUds4NYvVHXg-GA",
        "userName": "Leslie",
        "content": "Doesn't work with android. That should have been disclosed when I bought the fan.",
        "score": 1,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.0.29"
    },
    {
        "reviewId": "gp:AOqpTOF6IHffNq9F9DEB_lFLlX2H1x990S_IVzrxdkjl6mIXSr4xGZyWxrVS_caQXahlrvlU98wpk4ek_-MMjfU",
        "userName": "Susan Seitz",
        "content": "This app worked great until now. Now it doesn't open and I cant change the speed of my fan...so frustrated and disappointed.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOEg4CH7Nax3uT-3FhpiaaIFb-8gvxbAc-Kuk_wV4ia6G9q5c6OhUluBULs83HbbntmScB7tGmzb2u7__zc",
        "userName": "Edgar Marquez",
        "content": "Just like everybody else, trying to use the app and just doesn't work at all... honestly if this doesn't change I don't see myself buying hunter ever again... why do you offer a service if it doesn't work?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.0.29"
    },
    {
        "reviewId": "gp:AOqpTOEOHeH1pF2Nh_taNhc_I4h_zZXqydbZ6DG7lvzR7X8wkcriTsJJ5nYLkPifrefkovASE0CXpkdfsz-uEzA",
        "userName": "Najuan Mack",
        "content": "Doesn't work It would not manually give me a list of Hunter ceiling fans so that I could sync the app to the fan. Disappointment.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOH9DLfl517Ubk1j2vBwerzPm8NgNQxkyUlJo6bk3HL-4LEC4r_K1s82uiRJzdfsZbNauzLdTZp0KTTPW7M",
        "userName": "Robert Fiallo II",
        "content": "Garbage. The original app never worked. The new app repeatedly toggles wifi on and off during registration failing to ever make it past initial set up. How hard is it to make a simple wifi device when hundreds of cheaper devices work just fine?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOEutCDXFZJKAIqxcVp1FBBwLqeeV7d3UHDRnZokB77QXshw4m1voht_cWU14prYttZdAxcmM6F14TdwQw8",
        "userName": "Agastheesh Murali",
        "content": "Doesn't connect to older fans. Mine is only 4 months old.",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.0.29"
    },
    {
        "reviewId": "gp:AOqpTOEZF2oNyphM6GHx7MVYip7Pq0_wXjl7mi6QNJI6IFTCifMOwDX8AO1rAtiGcTSWpvmESbTKQPJaCqTuUtk",
        "userName": "jeff ivanoff",
        "content": "Absolute horrible!",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.0.29"
    },
    {
        "reviewId": "gp:AOqpTOEU5pVcvpsmHwOUb31eTCy2zBEncHNbv9Vm9mk2gCom-AEfRE43lqanuR3cS8jpk0VWOQ7LV9b1QflC_Rw",
        "userName": "Siju George",
        "content": "With new app there is no option to enter the pin from the SimpleConnect wall controller. And the old app where the device was registered stopped working after Android 10 upgrade. Hunter company you cannot just dump your old users just like that",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.0.26"
    },
    {
        "reviewId": "gp:AOqpTOEHMgfFpTuofsWH7vKzp7GNJQ4FWNAORaAPeKnAt4aiWW9D6JZ37COKk6QTY_VWtO4sQ65FG0yIq5IxmPY",
        "userName": "Jay A",
        "content": "It worked fine for the last 3 years now there's an update and neither app works, my fan doesn't have a QR code it was one of the early models and it won't give me any choices to choose it off of the list because the list is blank, even the pin is useless! Android updated now my fan won't do the very thing I bought it for. Next time I'm going with a different brand. I feel cheated for the amount this fan costs because of the app convenience!",
        "score": 1,
        "thumbsUpCount": 7,
        "reviewCreatedVersion": "v1.0.24"
    },
    {
        "reviewId": "gp:AOqpTOGVAsKlVAtHu62mzEsIvpTXdFNQntEXGRImOvP0THQsNKR_IDUTAdpqc75cRyRW2RaO20CU15sTNNwetz4",
        "userName": "Peter Lomason",
        "content": "First BEWARE: all hunter apps are managed by some chinese company, USE A DIFFERENT/UNIQUE PASSWORD, in the past I contacted support and was connected to somebody unable to speak English that had access to their accounts database. New version broke the routines I made that actually had the old garbage working. Too little too late. I unfortunately have three of these fans, they will be the last hunter products I ever own.",
        "score": 1,
        "thumbsUpCount": 5,
        "reviewCreatedVersion": "v1.0.24"
    },
    {
        "reviewId": "gp:AOqpTOE3pVLPGGhuuz9LKl_khzeYlIlQNWlbrmwsgXjUtY9RJo7ecu0i56ag6MdJG_9iRdbNMywkCREyYSUR-Yk",
        "userName": "Linda Shamonsky",
        "content": "Does not work. Supposed to send me email to set up. Never received email x 4",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null
    },
    {
        "reviewId": "gp:AOqpTOF5_lhBuY4AWTyUPxJGCyv4YUvMW7h5_Cyk_PqLGoHP_tfMO8fuquc6pNfN_ZVUez0xUrI7jM3KldK0KcY",
        "userName": "Sally Finney Timm",
        "content": "Despite going through the connection process multiple times, the app still won't recognize my fan. Very disappointing.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.0.24"
    },
    {
        "reviewId": "gp:AOqpTOHZENOoY1U19vS8dyK6GcqWti9ZBMd8ZYGLCkEruM-JVxT72HI6IaL83hgKvCO3Y7KKwJAvTbG5KlD4D60",
        "userName": "nathan robb",
        "content": "Literally unusable. The first app stopped working with the new Android update. Downloaded this one and made an account. Now I can't even click the sign in button to sign into the account.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.0.24"
    },
    {
        "reviewId": "gp:AOqpTOEmlS5XwKhLQYHTJe_cBIMxPfgOkGQrLiiTgg89VJABfcphPV65h2NMt7OvhwPUr3Ftq7g-_nfiEm9V8OE",
        "userName": "John Behm",
        "content": "Signed up on old app. Forgot what password I used. Now this one says I don't have a network connection when I try to request it to send me the password.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.0.21"
    },
    {
        "reviewId": "gp:AOqpTOG8gPQkoSFT-1rP4Wfw_KBjQS2dZxzmd1EIMYiQ7ox4LJ-zhHG3AsxbqQCuuUEcFuKDvMpTkscakoWp5RY",
        "userName": "Jason Tyler",
        "content": "Finally got it to work after many tries. Every time it tried to register the fan it would toggle wifi on and off and would fail. I finally went into my router and disabled the 5G signal. The app turns the 2.4 off which caused the 5g to want to take over. Other than that the app seems to work. I wish it would work no matter if the wall switch was on or off.",
        "score": 4,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.0.21"
    },
    {
        "reviewId": "gp:AOqpTOHTDKDz1vdUW2DhR8q1BNcMxo7CSnycBZUvIceSjoOvnEd-M1z-ZQR_pJ_p-RgzbL8LRMsxVjoPOE4boB4",
        "userName": "William Henderson",
        "content": "Stay away from these. Interesting hunter fan company support is following this app close but not posts to the simpleconnect app. Just note we customers are noting how you've let that app. be broke for android 10 and are now skeptical of all your products. Stay away from hunter fan if you want your product to work and be supported. Will update this if we see you step it up across the portfolio.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.0.18"
    },
    {
        "reviewId": "gp:AOqpTOHsD3F44v9HkMsJGXTa3ILZVz8bEWvh_LMM4TSTW3GdWqlEWboK9-L4zBsBrT86d0kHcv_0wHAAZ1MGhWM",
        "userName": "Nikita Rushmanov",
        "content": "No Google Home integration. Useless in my smart home ecosystem. Going to be returning the fan.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.0.18"
    },
    {
        "reviewId": "gp:AOqpTOFJvw64KUjP4g9W4MI0Lv4qucBf5YSk4dKbdnXrGLhHNPoUyUZ6M9skLy77FbHV-PLsLkTKUv2K7wciGdk",
        "userName": "Paul Lynn",
        "content": "This app does not work. Hunter customer service is worthless. I paid extra to get a wifi enabled fan and it was throwing money down the drain. Don't buy this fan. After trying registration with 3 different emails (all deemed invalid by Simple connect) this morning registration worked. I've changed my rating to 3 stars, still buggy.",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.0.18"
    },
    {
        "reviewId": "gp:AOqpTOFqimaPh2ZA2A-bh-5eFYKD5JUz-xSuOrSAL_zXQDqqIcxElWCrpjdg4469QmJow6pls2xg0muFc7fmj4o",
        "userName": "rudy widjaja",
        "content": "Not bad. Better than v1",
        "score": 4,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "v1.0.16"
    },
    {
        "reviewId": "gp:AOqpTOGTmXQiFWiqamD8QEYO8domnuwtUrN86ZE8FHvS0oldKpVPQ6ME3siaonQP7YbN5l733wkIiyYXj2gardQ",
        "userName": "Cybil Brandt",
        "content": "Better than the old app (simpleconnect wifi). Unfortunately, connection worked on my tablet but not via my phone through dozens of attempts. Something must be interfering. Anyhow, that made a wifi ssid change a nightmare. Otherwise the app and Alexa integration have worked well.",
        "score": 4,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "v1.0.16"
    },
    {
        "reviewId": "gp:AOqpTOECgWgJhSqOXAaRlKFOOSlk0P6euTfIm5OBFylNea48r7ups7_VLJWUvdKZ7QkuQXJY_FYO7JN51Xh3tak",
        "userName": "Chary Vazquez",
        "content": "After you go thru the process of subscribing without testing if it would work or not, it doesn't give you access to choose from list manually.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "v1.0.16"
    },
    {
        "reviewId": "gp:AOqpTOGu1BkktSXxTpqDSqM4DAy4w3Pn3VMftSpKbe0A8wXpEQzOTsThQTP60Ch6tgn0IsYNMJn07Du1cfmxlmI",
        "userName": "cayla gamwell",
        "content": "So far so good",
        "score": 5,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "v1.0.16"
    }
]